const qnaFinal=[
  {
    q: '주로 어느 시간대에 여가활동을 하나요?',
    a: [
      { answer: '평일', type: ['cow', 'tiger', 'dragon', 'chick'] },
      { answer: '주말', type: ['mouse', 'rabbit', 'horse', 'snake', 'dog', 'monkey'] },
    ]
  },
  {
    q: '당신의 성별을 선택해주세요.',
    a: [
      { answer: '남자', type: ['cow', 'tiger', 'dragon', 'chick'] },
      { answer: '여자', type: ['mouse', 'rabbit', 'horse', 'snake', 'dog', 'monkey'] },
      { answer: '선택하지 않음', type: ['sheep', 'pig' ] },
    ]
  },
  {
    q: '당신의 나이대를 선택해주세요',
    a: [
      { answer: '10대', type: ['cow', 'tiger', 'dragon', 'chick'] },
      { answer: '20대', type: ['mouse', 'rabbit', 'horse', 'snake', 'dog', 'monkey'] },
      { answer: '30대', type: ['sheep', 'pig' ] },
      { answer: '40대', type: ['sheep', 'pig' ] },
      { answer: '50대', type: ['sheep', 'pig' ] },
      { answer: '60대', type: ['sheep', 'pig' ] },
      { answer: '70대 이상', type: ['sheep', 'pig' ] },
    ]
  },
]
const big_cat=[
  '문화예술관람활동','문화예술참여활동','스포츠관람활동',
  '스포츠참여활동','관광활동','취미/오락활동',
  '휴식활동','사회/기타활동'
]
let result_weight=[1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0]
const week_weight=[
  [//평일
    [//성별 체크
      [0.9,0.9,0.9,0.9,1.1,1.2,1.2,1.1],//남자
      [0.9,0.9,0.9,0.9,1.1,1.1,1.2,1.2],//여자
      [1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0]
    ],
    [
      [0.9,0.9,0.9,1.1,0.9,1.1,1.2,1.2],//10대
      [1.0,0.9,1.0,1.1,0.9,1.1,1.2,1.2],//20대
      [0.9,0.9,0.9,1.0,1.1,1.1,1.2,1.2],//30대
      [0.9,0.9,0.9,1.0,1.1,1.1,1.2,1.2],//40대
      [0.9,0.9,0.9,0.9,1.1,1.2,1.1,1.2],//50대
      [0.9,0.9,0.9,0.9,1.1,1.2,1.1,1.2],//60대
      [0.9,0.9,0.9,0.9,1.1,1.2,1.1,1.2]//70대이상
    ]
  ],
  [//휴일
    [
      [0.9,0.9,0.9,1.0,1.1,1.2,1.2,1.1],//남자
      [0.9,0.9,0.9,1.0,1.1,1.2,1.2,1.1],//여자
      [1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0]
    ],
    [
      [1.0,0.9,0.9,1.1,1.0,1.1,1.2,1.2],//10대
      [1.0,0.9,1.0,1.1,1.0,1.2,1.2,1.1],//20대
      [0.9,0.9,0.9,1.0,1.1,1.1,1.2,1.2],//30대
      [1.0,0.9,0.9,0.9,1.1,1.1,1.2,1.2],//40대
      [0.9,0.9,0.9,1.0,1.1,1.2,1.2,1.1],//50대
      [0.9,0.9,0.9,0.9,1.1,1.2,1.2,1.1],//60대
      [0.9,0.9,0.9,0.9,1.1,1.2,1.2,1.1]//70대이상
    ]
  ]
]

const leisure_dict_search=[
  //문화예술관람활동
  ['미술_전시회_관람','사진_전시회_관람','건축_전시회_관람','디자인_전시회_관람',
  '박물관_관람',
  '클래식_음악_연주회_관람','오페라_음악_연주회_관람',
  '국악_전통공연_관람','민속놀이_공연_관람',
  '연극공연_관람','뮤지컬_관람',
  '무용_공연_관람',
  '영화_관람',
  '쇼_공연_관람','콘서트_공연_관람','마술_쇼_공연_관람'],
  //문화예술참여활동
  ['문학_행사_참여',
  '글짓기_참여' ,'독서_토론_참여',
  '그림_활동_참여','서예_활동_참여','조각_활동_참여','디자인_활동_참여','도예_활동_참여','만화_활동_참여',
  '악기_연주_참여','노래교실 참여',
  '춤_참여','무용_참여','발레_참여','한국무용_참여','현대무용_참여','방송댄스_참여','스트릿댄스_참여','비보잉_참여',
  '사진_촬영',
  '사물놀이_참여','줄타기_참여'],
  //스포츠관람활동
  ['축구_경기장_방문_관람' ,'야구_경기장_방문_관람','농구_경기장_방문_관람','배구_경기장_방문_관람',
  '축구_경기_티비_관람','야구_경기_티비_관람','농구_경기_티비_관람','배구_경기_티비_관람',
  '태권도_경기_관람','유도_경기_관람','합기도_경기_관람','검도_경기_관람','권투_경기_관람',
  'e-스포츠_경기_관람'],
  //스포츠참여활동
  ['농구_참가','배구_참가','야구_참가','축구_참가','족구_참여',
  '테니스_참여','스쿼시_참여',
  '당구_참여','포켓볼_참여',
  '볼링_참여','탁구_참여',
  '골프_참여',
  '수영_참여' ,
  '윈드서핑_참여','수상스키_참여','스킨스쿠버다이빙_참여','래프팅_참여','요트_참여',
  '스노보드_참여','스키_참여',
  '아이스스케이트_참여','아이스하키_참여',
  '헬스_참여','보디빌딩_참여','에어로빅_참여',
  '요가_참여','필라테스_참여','태보_운동_참여',
  '배드민턴_참여','줄넘기_참여','맨손_체조_참여','스트레칭_참여','훌라후프_참여',
  '육상_참여','조깅_참여','빠르게_걷기_참여',
  '태권도_참여','유도_경기_참가','합기도_참여','검도_참여','권투_참여',
  '탱고_참여','왈츠_댄스_참여','자이브_참여','맘보_참여','폴카_댄스_참여','차차차_댄스_참여',
  '사이클링_참여','자전거_참여',
  '인라인_스케이트_참여',
  '승마_참여','암벽등반_참여','철인삼종경기_참여','서바이벌_참여'],
  //관광활동
  ['문화유적_방문',
  '자연명승_방문','풍경_관람',
  '삼림욕',
  '국내캠핑',
  '해외여행',
  '소풍','야유회',
  '온천','해수욕',
  '유람선_타기',
  '테마파크_가기','놀이공원_가기','동물원_가기','식물원_가기',
  '지역축제_참가',
  '자동차_드라이브'],
  //취미오락활동
  ['콜렉션','스크랩북',
  '십자수','비즈공예', 'DIY','꽃꽂이',
  '요리하기','다도',
  '반려동물_키우기',
  '노래방_가기',
  '집_인테리어','자동차_인테리어',
  '등산',
  '낚시',
  '홈페이지_관리','블로그_관리',
  '인터넷_검색','1인_미디어_제작','SNS',
  '온라인_게임','모바일_게임','콘솔_게임',
  '보드게임','퍼즐','큐브_맞추기',
  '바둑','장기','체스',
  '경마','경륜','카드놀이','고스톱','마작','복권구입',
  '쇼핑','외식',
  '음주',
  '독서','웹소설',
  '만화보기','웹툰보기',
  '피부관리','헤어관리','네일아트','마사지','성형',
  '어학_공부','기술_공부','자격증_공부',
  '방탈출_카페_체험','VR_카페_체험','낚시카페_체험',
  '원예','화단_가꾸기'],
  //휴식활동
  ['산책','걷기',
  '목욕','사우나','찜질방',
  '낮잠',
  'TV_시청',
  '모바일_컨텐츠','동영상_시청',
  '라디오_청취','팟캐스트_청취',
  '음악_감상',
  '신문_보기','잡지_보기',
  '아무것도_안_하기'],
  //사회 및 기타활동
  ['사회봉사',
  '종교활동',
  '클럽_가기','나이트_가기','디스코_가기','캬바레_가기',
  '가족_방문','친지_방문',
  '잡담','통화하기','문자보내기',
  '계모임','동창회','사교파티',
  '친구_만남','이성교제','미팅','소개팅',
  '동호회_모임']
]
